In [2]:
import pandas as pd

In [3]:
import numpy as np

In [6]:
wines = pd.read_csv("wine.csv", usecols=[0,1,7], names=["classe","alcol","flavonoidi"])

In [7]:
wines.head()

  classe    alcol  flavonoidi
0   Wine  Alcohol  Flavanoids
1      1    14.23        3.06
2      1     13.2        2.76
3      1    13.16        3.24
4      1    14.37        3.49

In [8]:
Y = wines["classe"].values

In [9]:
X = wines.drop("classe",axis=1).values

In [11]:
print(Y)

['Wine' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1'
 '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1'
 '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1' '1'
 '1' '1' '1' '1' '1' '1' '1' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2'
 '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2'
 '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2'
 '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2' '2'
 '2' '2' '2' '2' '2' '2' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3'
 '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3'
 '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3' '3']

In [12]:
wines.describe()

       classe  alcol flavonoidi
count     179    179        179
unique      4    127        133
top         2  13.05       2.65
freq       71      6          4

In [14]:
wines_norm = wines.copy()

In [15]:
features = ["alcol","flavonoidi"]

In [16]:
to_norm = wines[features]

In [18]:
to_norm.head()

     alcol  flavonoidi
0  Alcohol  Flavanoids
1    14.23        3.06
2     13.2        2.76
3    13.16        3.24
4    14.37        3.49

In [19]:
to_norm.min()

alcol         11.03
flavonoidi      .34
dtype: object

In [20]:
to_norm.max()

alcol            Alcohol
flavonoidi    Flavanoids
dtype: object

In [23]:
to_norm = to_norm.drop(0,axis=0)

In [24]:
to_norm.head()

   alcol flavonoidi
1  14.23       3.06
2   13.2       2.76
3  13.16       3.24
4  14.37       3.49
5  13.24       2.69

In [25]:
to_norm.max()

alcol         14.83
flavonoidi     5.08
dtype: object

In [28]:
to_norm.head()

   alcol flavonoidi
1  14.23       3.06
2   13.2       2.76
3  13.16       3.24
4  14.37       3.49
5  13.24       2.69

In [29]:
to_norm.columns

Index(['alcol', 'flavonoidi'], dtype='object')

In [30]:
to_norm.min()

alcol         11.03
flavonoidi      .34
dtype: object

In [31]:
to_norm.max()

alcol         14.83
flavonoidi     5.08
dtype: object

In [32]:
to_norm.iloc[0]

alcol         14.23
flavonoidi     3.06
Name: 1, dtype: object

In [33]:
wines_norm.head()

  classe    alcol  flavonoidi
0   Wine  Alcohol  Flavanoids
1      1    14.23        3.06
2      1     13.2        2.76
3      1    13.16        3.24
4      1    14.37        3.49

In [35]:
wines_norm = wines_norm.drop(0,axis=0)

In [36]:
wines_norm.head()

  classe  alcol flavonoidi
1      1  14.23       3.06
2      1   13.2       2.76
3      1  13.16       3.24
4      1  14.37       3.49
5      1  13.24       2.69

In [38]:
to_norm.head()

   alcol flavonoidi
1  14.23       3.06
2   13.2       2.76
3  13.16       3.24
4  14.37       3.49
5  13.24       2.69

In [39]:
to_norm.describe()

        alcol flavonoidi
count     178        178
unique    126        132
top     13.05       2.65
freq        6          4

In [40]:
to_norm.min()

alcol         11.03
flavonoidi      .34
dtype: object

In [41]:
to_norm.max()

alcol         14.83
flavonoidi     5.08
dtype: object

In [42]:
to_norm

     alcol flavonoidi
1    14.23       3.06
2     13.2       2.76
3    13.16       3.24
4    14.37       3.49
5    13.24       2.69
..     ...        ...
174  13.71        .61
175   13.4        .75
176  13.27        .69
177  13.17        .68
178  14.13        .76

[178 rows x 2 columns]

In [43]:
to_norm.columns

Index(['alcol', 'flavonoidi'], dtype='object')

In [44]:
wines = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", names=['class','alcol','flavonoidi'], 
                    usecols=[0,1,7])

In [45]:
wines_norm = wines.copy()

In [46]:
features = ["alcol","flavonoidi"]

In [47]:
to_norm = wines_norm[features]

In [48]:
wines_norm[features] = (to_norm-to_norm.min())/(to_norm.max()-to_norm.min())

In [49]:
wines_norm.head()

   class     alcol  flavonoidi
0      1  0.842105    0.573840
1      1  0.571053    0.510549
2      1  0.560526    0.611814
3      1  0.878947    0.664557
4      1  0.581579    0.495781

In [50]:
from sklearn.preprocessing import MinMaxScaler

In [51]:
mms = MinMaxScaler()

In [59]:
X = wines.drop("class",axis=1).values

In [60]:
X_norm = mms.fit_transform(X)

In [61]:
X_norm[:5]

array([[0.84210526, 0.57383966],
       [0.57105263, 0.51054852],
       [0.56052632, 0.61181435],
       [0.87894737, 0.66455696],
       [0.58157895, 0.49578059]])

In [62]:
print(X)

[[14.23  3.06]
 [13.2   2.76]
 [13.16  3.24]
 [14.37  3.49]
 [13.24  2.69]
 [14.2   3.39]
 [14.39  2.52]
 [14.06  2.51]
 [14.83  2.98]
 [13.86  3.15]
 [14.1   3.32]
 [14.12  2.43]
 [13.75  2.76]
 [14.75  3.69]
 [14.38  3.64]
 [13.63  2.91]
 [14.3   3.14]
 [13.83  3.4 ]
 [14.19  3.93]
 [13.64  3.03]
 [14.06  3.17]
 [12.93  2.41]
 [13.71  2.88]
 [12.85  2.37]
 [13.5   2.61]
 [13.05  2.68]
 [13.39  2.94]
 [13.3   2.19]
 [13.87  2.97]
 [14.02  2.33]
 [13.73  3.25]
 [13.58  3.19]
 [13.68  2.69]
 [13.76  2.74]
 [13.51  2.53]
 [13.48  2.98]
 [13.28  2.68]
 [13.05  2.43]
 [13.07  2.64]
 [14.22  3.04]
 [13.56  3.29]
 [13.41  2.68]
 [13.88  3.56]
 [13.24  2.63]
 [13.05  3.  ]
 [14.21  2.65]
 [14.38  3.17]
 [13.9   3.39]
 [14.1   2.92]
 [13.94  3.54]
 [13.05  3.27]
 [13.83  2.99]
 [13.82  3.74]
 [13.77  2.79]
 [13.74  2.9 ]
 [13.56  2.78]
 [14.22  3.  ]
 [13.29  3.23]
 [13.72  3.67]
 [12.37  0.57]
 [12.33  1.09]
 [12.64  1.41]
 [13.67  1.79]
 [12.37  3.1 ]
 [12.17  1.75]
 [12.37  2.65]
 [13.11  3.18]
 [12.37  2.  ]
 [13.34  1.3 ]
 [12.21  1.28]
 [12.29  1.02]
 [13.86  2.86]
 [13.49  1.84]
 [12.99  2.89]
 [11.96  2.14]
 [11.66  1.57]
 [13.03  2.03]
 [11.84  1.32]
 [12.33  1.85]
 [12.7   2.55]
 [12.    2.26]
 [12.72  2.53]
 [12.08  1.58]
 [13.05  1.59]
 [11.84  2.21]
 [12.67  1.94]
 [12.16  1.69]
 [11.65  1.61]
 [11.64  1.69]
 [12.08  1.59]
 [12.08  1.5 ]
 [12.    1.25]
 [12.69  1.46]
 [12.29  2.25]
 [11.62  2.26]
 [12.47  2.27]
 [11.81  0.99]
 [12.29  2.5 ]
 [12.37  3.75]
 [12.29  2.99]
 [12.08  2.17]
 [12.6   1.36]
 [12.34  2.11]
 [11.82  1.64]
 [12.51  1.92]
 [12.42  1.84]
 [12.25  2.03]
 [12.72  1.76]
 [12.22  2.04]
 [11.61  2.92]
 [11.46  2.58]
 [12.52  2.27]
 [11.76  2.03]
 [11.41  2.01]
 [12.08  2.29]
 [11.03  2.17]
 [11.82  1.6 ]
 [12.42  2.09]
 [12.77  1.25]
 [12.    1.64]
 [11.45  2.79]
 [11.56  5.08]
 [12.42  2.13]
 [13.05  2.65]
 [11.87  3.03]
 [12.07  2.65]
 [12.43  3.15]
 [11.79  2.24]
 [12.37  2.45]
 [12.04  1.75]
 [12.86  1.25]
 [12.88  1.22]
 [12.81  1.09]
 [12.7   1.2 ]
 [12.51  0.58]
 [12.6   0.66]
 [12.25  0.47]
 [12.53  0.6 ]
 [13.49  0.48]
 [12.84  0.6 ]
 [12.93  0.5 ]
 [13.36  0.5 ]
 [13.52  0.52]
 [13.62  0.8 ]
 [12.25  0.78]
 [13.16  0.55]
 [13.88  0.34]
 [12.87  0.65]
 [13.32  0.76]
 [13.08  1.39]
 [13.5   1.57]
 [12.79  1.36]
 [13.11  1.28]
 [13.23  0.83]
 [12.58  0.58]
 [13.17  0.63]
 [13.84  0.83]
 [12.45  0.58]
 [14.34  1.31]
 [13.48  1.1 ]
 [12.36  0.92]
 [13.69  0.56]
 [12.85  0.6 ]
 [12.96  0.7 ]
 [13.78  0.68]
 [13.73  0.47]
 [13.45  0.92]
 [12.82  0.66]
 [13.58  0.84]
 [13.4   0.96]
 [12.2   0.49]
 [12.77  0.51]
 [14.16  0.7 ]
 [13.71  0.61]
 [13.4   0.75]
 [13.27  0.69]
 [13.17  0.68]
 [14.13  0.76]]

In [64]:
wines.head()

   class  alcol  flavonoidi
0      1  14.23        3.06
1      1  13.20        2.76
2      1  13.16        3.24
3      1  14.37        3.49
4      1  13.24        2.69

In [65]:
test = wines.copy()

In [66]:
test.head()

   class  alcol  flavonoidi
0      1  14.23        3.06
1      1  13.20        2.76
2      1  13.16        3.24
3      1  14.37        3.49
4      1  13.24        2.69